// BSLLS:UnusedParameters-off

&Родитель
Перем ХранилищеСущностей;

&МетодЗапроса
Функция ПолучитьОдноПоИдентификаторРавно(Идентификатор) Экспорт
	Возврат Неопределено;
КонецФункции


&МетодЗапроса
Функция ПолучитьПервыеСоСмещениемПоИдентификаторБольшеИлиРавноУпорядочитьПоИдентификаторУбыв(
	Первые, 
	Смещение, 
	Идентификатор
) Экспорт
	Возврат Неопределено;
КонецФункции

Функция НайтиПоИдентификатору(Идентификатор) Экспорт
	Возврат ХранилищеСущностей.ПолучитьОдно(Идентификатор);
КонецФункции

&ХранилищеСущностей("ФизическоеЛицо")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
