#Использовать ".."
#Использовать "."
#Использовать autumn

&Тест
Процедура КогдаНеЗаданыНастройкиПодключения_ТогдаИсточникиДанныхНеОпределены() Экспорт

	// Дано
	Поделка = Новый Поделка;
	Поделка.ЗапуститьПриложение();
	
	// Когда-Тогда
	ПараметрыМетода = Новый Массив;
	ПараметрыМетода.Добавить("ИсточникДанных");

	Ожидаем.Что(Поделка)
		.Метод("НайтиЖелудь", ПараметрыМетода)
		.ВыбрасываетИсключение("Не удалось получить определение Желудя по имени Желудя ИсточникДанных");
	
КонецПроцедуры

&Тест
Процедура КогдаЗаполненыИсточникиДанныхКакСоответствие_ТогдаВозвращаетсяОдинИсточникДанных() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ИсточникиДанных = Поделка.НайтиЖелуди("ИсточникДанных", , "Соответствие");

	// Тогда
	Ожидаем.Что(ИсточникиДанных.Количество()).Равно(1);
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"]).ИмеетТип("ИсточникДанных");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].Имя()).Равно("Основной");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].ТипКоннектора()).Равно(Тип("КоннекторInMemory"));
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].СтрокаСоединения()).Равно("");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].ПараметрыКоннектора().Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура КогдаЗаполненыИсточникиДанныхКакСоответствие_ТогдаВозвращаетсяВерховныйИсточникДанных() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ИсточникДанных = Поделка.НайтиЖелудь("ИсточникДанных");

	// Тогда
	Ожидаем.Что(ИсточникДанных).ИмеетТип("ИсточникДанных");
	Ожидаем.Что(ИсточникДанных.Имя()).Равно("Основной");
	Ожидаем.Что(ИсточникДанных.ТипКоннектора()).Равно(Тип("КоннекторInMemory"));
	Ожидаем.Что(ИсточникДанных.СтрокаСоединения()).Равно("");
	Ожидаем.Что(ИсточникДанных.ПараметрыКоннектора().Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура КогдаЗаполненыИсточникиДанныхКакМассив_ТогдаВозвращаетВсеИсточникиДанных() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ИсточникиДанных = Поделка.НайтиЖелуди("ИсточникДанных", , "Соответствие");

	// Тогда
	Ожидаем.Что(ИсточникиДанных.Количество()).Равно(2);

	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"]).ИмеетТип("ИсточникДанных");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].Имя()).Равно("Основной");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].ТипКоннектора()).Равно(Тип("КоннекторInMemory"));
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].СтрокаСоединения()).Равно("");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхОсновной"].ПараметрыКоннектора().Количество()).Равно(0);

	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхДополнительный"]).ИмеетТип("ИсточникДанных");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхДополнительный"].Имя()).Равно("Дополнительный");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхДополнительный"].ТипКоннектора()).Равно(Тип("КоннекторSQLite"));
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхДополнительный"].СтрокаСоединения()).Равно("FullUri=file::memory:?cache=shared");
	Ожидаем.Что(ИсточникиДанных["ИсточникДанныхДополнительный"].ПараметрыКоннектора().Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура КогдаЗаполненыИсточникиДанныхКакМассив_ТогдаВозвращаетВерховныйИсточникДанных() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ИсточникДанных = Поделка.НайтиЖелудь("ИсточникДанных");

	// Тогда
	Ожидаем.Что(ИсточникДанных).ИмеетТип("ИсточникДанных");
	Ожидаем.Что(ИсточникДанных.Имя()).Равно("Основной");
	Ожидаем.Что(ИсточникДанных.ТипКоннектора()).Равно(Тип("КоннекторInMemory"));
	Ожидаем.Что(ИсточникДанных.СтрокаСоединения()).Равно("");
	Ожидаем.Что(ИсточникДанных.ПараметрыКоннектора().Количество()).Равно(0);

КонецПроцедуры

&Тест
Процедура КогдаЗаполненыИсточникиДанныхКакМассивНоОдинБезИмени_ТогдаБросаетсяИсключение() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиИОдинБезИмениКакМассив();

	ИсключениеБрошено = Ложь;
	ТекстИсключения = "";
	Попытка
		Поделка = Новый Поделка(СоветДругогоМастера);
	Исключение
		ИсключениеБрошено = Истина;
		ТекстИсключения = ОписаниеОшибки();
	КонецПопытки;

	Если НЕ ИсключениеБрошено Тогда
		ВызватьИсключение "Исключение не было выброшено";
	КонецЕсли;

	Ожидаем.Что(ТекстИсключения).Содержит("Не указано <Имя> источника данных #1");

КонецПроцедуры
