#Использовать ".."
#Использовать "."
#Использовать autumn

&Пластилин
Перем Поделка;

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие()")
Процедура КогдаЗаполненыИсточникиДанныхКакСоответствие_ТогдаВозвращаетсяОдинМенеджерСущностей() Экспорт

	// Дано-Когда
	МенеджерыСущностей = Поделка.НайтиЖелуди("МенеджерСущностей", , "Соответствие");

	// Тогда
	Ожидаем.Что(МенеджерыСущностей.Количество()).Равно(1);
	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейОсновной"]).ИмеетТип("МенеджерСущностей");
	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейОсновной"].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие()")
Процедура КогдаЗаполненыИсточникиДанныхКакСоответствие_ТогдаВозвращаетсяВерховныйМенеджерСущностей() Экспорт

	// Дано-Когда
	МенеджерСущностей = Поделка.НайтиЖелудь("МенеджерСущностей");

	// Тогда
	Ожидаем.Что(МенеджерСущностей).ИмеетТип("МенеджерСущностей");
	Ожидаем.Что(МенеджерСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив()")
Процедура КогдаЗаполненыИсточникиДанныхКакМассив_ТогдаВозвращаетВсеМенеджерыСущностей() Экспорт

	// Дано-Когда
	МенеджерыСущностей = Поделка.НайтиЖелуди("МенеджерСущностей", , "Соответствие");

	// Тогда
	Ожидаем.Что(МенеджерыСущностей.Количество()).Равно(2);

	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейОсновной"]).ИмеетТип("МенеджерСущностей");
	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейОсновной"].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейДополнительный"]).ИмеетТип("МенеджерСущностей");
	Ожидаем.Что(МенеджерыСущностей["МенеджерСущностейДополнительный"].ПолучитьКоннектор()).ИмеетТип("КоннекторSQLite");

КонецПроцедуры

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив()")
Процедура КогдаЗаполненыИсточникиДанныхКакМассив_ТогдаВозвращаетВерховныйМенеджерСущностей() Экспорт

	// Дано-Когда
	МенеджерСущностей = Поделка.НайтиЖелудь("МенеджерСущностей");

	// Тогда
	Ожидаем.Что(МенеджерСущностей).ИмеетТип("МенеджерСущностей");
	Ожидаем.Что(МенеджерСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры
