#Использовать ".."
#Использовать autumn
#Использовать asserts


Функция ПолучитьТокенайзерИзФабрики()
	//ПодключитьСценарий("src/Классы/ФабрикаТокенайзер.os", "ФабрикаТокенайзер");
	//ПодключитьСценарий("src/Классы/ТокенКлючевоеСлово.os", "ТокенКлючевоеСлово");
	//ПодключитьСценарий("src/Классы/ТокенИдентификаторПоля.os", "ТокенИдентификаторПоля");
	Возврат Новый ФабрикаТокенайзер.ПолучитьТокенайзерЗапросов();
КонецФункции

&Тест
Процедура ТокенайзерДлинногоМетода() Экспорт

	// Дано
	Токенайзер = ПолучитьТокенайзерИзФабрики();
	Токенайзер.Инит("ПолучитьПервыеПоИмяИФамилияРавноИВозрастБольшеИлиРавноУпорядочитьПоВозрастУбыв");

	// Когда
	Результат = Новый Массив;
	Пока Токенайзер.ЕстьЕщеТокены() Цикл
		Результат.Добавить(Токенайзер.СледующийТокен());
	КонецЦикла;

	// Тогда
	Ожидаем.Что(Результат.Количество()).Равно(12);

	Ожидаем.Что(Результат[0].ТипТокена()).Равно("ПолучитьПервые");
	Ожидаем.Что(Результат[1].ТипТокена()).Равно("По");
	Ожидаем.Что(Результат[2].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[3].ТипТокена()).Равно("И");
	Ожидаем.Что(Результат[4].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[5].ТипТокена()).Равно("Равно");
	Ожидаем.Что(Результат[6].ТипТокена()).Равно("И");
	Ожидаем.Что(Результат[7].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[8].ТипТокена()).Равно("БольшеИлиРавно");
	Ожидаем.Что(Результат[9].ТипТокена()).Равно("УпорядочитьПо");
	Ожидаем.Что(Результат[10].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[11].ТипТокена()).Равно("Убыв");

	Ожидаем.Что(Результат[2].Значение()).Равно("Имя");
	Ожидаем.Что(Результат[4].Значение()).Равно("Фамилия");
	Ожидаем.Что(Результат[7].Значение()).Равно("Возраст");
	Ожидаем.Что(Результат[10].Значение()).Равно("Возраст");
	
	
КонецПроцедуры

&Тест
Процедура ТокенайзерПоИнн() Экспорт

	// Дано
	Токенайзер = ПолучитьТокенайзерИзФабрики();
	Токенайзер.Инит("ПолучитьПоСвидетельствоИНН");

	// Когда 
	Результат = Новый Массив;
	Пока Токенайзер.ЕстьЕщеТокены() Цикл
		Результат.Добавить(Токенайзер.СледующийТокен());
	КонецЦикла;
	
	// Тогда

	Ожидаем.Что(Результат.Количество()).Равно(3);

	Ожидаем.Что(Результат[0].ТипТокена()).Равно("Получить");
	Ожидаем.Что(Результат[1].ТипТокена()).Равно("По");
	Ожидаем.Что(Результат[2].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[2].Значение()).Равно("СвидетельствоИНН");

КонецПроцедуры

ТокенайзерПоИнн();