#Использовать ".."
#Использовать autumn
#Использовать asserts

&Тест
Процедура ТокенайзерДлинногоМетода() Экспорт

	// Дано
	Токенайзер = Новый ТокенайзерЗапросов;
	СтрокаКРазбору = "ПолучитьПервыеПоИмяИФамилияРавноИВозрастБольшеИлиРавноУпорядочитьПоВозрастУбыв";
	Идентификаторы = Новый Массив();
	Идентификаторы.Добавить("Имя");
	Идентификаторы.Добавить("Фамилия");
	Идентификаторы.Добавить("Возраст");

	// Когда
	Результат = Токенайзер.Разобрать(СтрокаКРазбору, Идентификаторы);

	// Тогда
	Ожидаем.Что(Результат.Количество()).Равно(13);

	Ожидаем.Что(Результат[0].ТипТокена()).Равно("Получить");
	Ожидаем.Что(Результат[1].ТипТокена()).Равно("Первые");
	Ожидаем.Что(Результат[2].ТипТокена()).Равно("По");
	Ожидаем.Что(Результат[3].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[4].ТипТокена()).Равно("И");
	Ожидаем.Что(Результат[5].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[6].ТипТокена()).Равно("Равно");
	Ожидаем.Что(Результат[7].ТипТокена()).Равно("И");
	Ожидаем.Что(Результат[8].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[9].ТипТокена()).Равно("БольшеИлиРавно");
	Ожидаем.Что(Результат[10].ТипТокена()).Равно("УпорядочитьПо");
	Ожидаем.Что(Результат[11].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[12].ТипТокена()).Равно("Убыв");

	Ожидаем.Что(Результат[3].Значение()).Равно("Имя");
	Ожидаем.Что(Результат[5].Значение()).Равно("Фамилия");
	Ожидаем.Что(Результат[8].Значение()).Равно("Возраст");
	Ожидаем.Что(Результат[11].Значение()).Равно("Возраст");
	
КонецПроцедуры

&Тест
Процедура ТокенайзерПоИнн() Экспорт

	// Дано
	Токенайзер = Новый ТокенайзерЗапросов;
	СтрокаКРазбору = "ПолучитьПоСвидетельствоИНН";
	Идентификаторы = Новый Массив();
	Идентификаторы.Добавить("СвидетельствоИНН");

	// Когда 
	Результат = Токенайзер.Разобрать(СтрокаКРазбору, Идентификаторы);
	
	// Тогда

	Ожидаем.Что(Результат.Количество()).Равно(3);

	Ожидаем.Что(Результат[0].ТипТокена()).Равно("Получить");
	Ожидаем.Что(Результат[1].ТипТокена()).Равно("По");
	Ожидаем.Что(Результат[2].ТипТокена()).Равно("Идентификатор");
	Ожидаем.Что(Результат[2].Значение()).Равно("СвидетельствоИНН");

КонецПроцедуры
