#Использовать ".."
#Использовать "."
#Использовать autumn

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностей_ТогдаОноПолучается() Экспорт
	
	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейОсновнойФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностейИЕстьОдинИсточникБезИмени_ТогдаОноПолучается() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомБезИмениИсточникаКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры
