#Использовать ".."
#Использовать "."
#Использовать autumn

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностей_ТогдаОноПолучается() Экспорт
	
	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейОсновнойФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностейИЕстьОдинИсточникБезИмени_ТогдаОноПолучается() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомБезИмениИсточникаКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
Процедура КогдаЗапрашиваетсяХранилищаСущностейПоИмениИсточника_ТогдаОниПолучаются() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейОсновной", , "Соответствие");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтраныМира"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтраныМира"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("СтраныМира");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтраныМира"].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическиеЛица"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическиеЛица"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическиеЛица"].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

	// Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейДополнительный", , "Соответствие");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокументы"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокументы"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("Документы");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокументы"].ПолучитьКоннектор()).ИмеетТип("КоннекторSQLite");

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическиеЛица"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическиеЛица"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическиеЛица"].ПолучитьКоннектор()).ИмеетТип("КоннекторSQLite");

КонецПроцедуры