#Использовать ".."
#Использовать "."
#Использовать autumn

&Пластилин
Перем Поделка;

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие()")
Процедура КогдаЗапрашиваетсяХранилищеСущностей_ТогдаОноПолучается() Экспорт

	// Дано-Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейОсновнойФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторInMemory"));

КонецПроцедуры

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСОднимКоннекторомБезИмениИсточникаКакСоответствие()")
Процедура КогдаЗапрашиваетсяХранилищеСущностейИЕстьОдинИсточникБезИмени_ТогдаОноПолучается() Экспорт

	// Дано-Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторInMemory"));

КонецПроцедуры

&Тест
&Изолированный(Совет = "() -> ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив()")
Процедура КогдаЗапрашиваетсяХранилищаСущностейПоИмениИсточника_ТогдаОниПолучаются() Экспорт

	// Дано-Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейОсновной", , "Соответствие");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтранаМира"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтранаМира"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("СтраныМира");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойСтранаМира"].ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторInMemory"));

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическоеЛицо"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическоеЛицо"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейОсновнойФизическоеЛицо"].ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторInMemory"));

	// Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейДополнительный", , "Соответствие");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокумент"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокумент"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("Документы");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйДокумент"].ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторSQLite"));

	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическоеЛицо"]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическоеЛицо"].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей["ХранилищеСущностейДополнительныйФизическоеЛицо"].ВычислитьСКоннектором("Коннектор -> ТипЗнч(Коннектор)")).Равно(Тип("КоннекторSQLite"));

КонецПроцедуры