#Использовать ".."
#Использовать "."
#Использовать autumn

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностей_ТогдаОноПолучается() Экспорт
	
	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейОсновнойФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
Процедура КогдаЗапрашиваетсяХранилищеСущностейИЕстьОдинИсточникБезИмени_ТогдаОноПолучается() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСОднимКоннекторомБезИмениИсточникаКакСоответствие();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	ХранилищеСущностей = Поделка.НайтиЖелудь("ХранилищеСущностейФизическоеЛицо");

	// Тогда
	Ожидаем.Что(ХранилищеСущностей).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(ХранилищеСущностей.ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

КонецПроцедуры

&Тест
Процедура КогдаЗапрашиваетсяХранилищаСущностейПоИмениИсточника_ТогдаОниПолучаются() Экспорт

	// Дано
	СоветДругогоМастера = ГенераторДанных.СоветДругогоМастераСДвумяКоннекторамиКакМассив();

	Поделка = Новый Поделка(СоветДругогоМастера);
	Поделка.ЗапуститьПриложение();

	// Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейОсновной");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей[0]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей[0].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("СтраныМира");
	Ожидаем.Что(НайденныеХранилищаСущностей[0].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

	Ожидаем.Что(НайденныеХранилищаСущностей[1]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей[1].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей[1].ПолучитьКоннектор()).ИмеетТип("КоннекторInMemory");

	// Когда
	НайденныеХранилищаСущностей = Поделка.НайтиЖелуди("ХранилищеСущностейДополнительный");

	// Тогда
	Ожидаем.Что(НайденныеХранилищаСущностей.Количество()).Равно(2);

	Ожидаем.Что(НайденныеХранилищаСущностей[0]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей[0].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("Документы");
	Ожидаем.Что(НайденныеХранилищаСущностей[0].ПолучитьКоннектор()).ИмеетТип("КоннекторSQLite");

	Ожидаем.Что(НайденныеХранилищаСущностей[1]).ИмеетТип("ХранилищеСущностей");
	Ожидаем.Что(НайденныеХранилищаСущностей[1].ПолучитьОбъектМодели().ИмяТаблицы()).Равно("ФизическиеЛица");
	Ожидаем.Что(НайденныеХранилищаСущностей[1].ПолучитьКоннектор()).ИмеетТип("КоннекторSQLite");

КонецПроцедуры