// BSLLS:UsingHardcodeNetworkAddress-off

#Использовать autumn
#Использовать entity

Функция СоветДругогоМастераСОднимКоннекторомКакСоответствие() Экспорт

	Детальки = Новый Соответствие();

	СекцияData = Новый Соответствие();
	Детальки.Вставить("data", СекцияData);

	ИсточникиДанных = Новый Соответствие();
	СекцияData.Вставить("ИсточникиДанных", ИсточникиДанных);

	ИсточникиДанных.Вставить("Имя", "Основной");
	ИсточникиДанных.Вставить("ТипКоннектора", "КоннекторInMemory");

	СоветДругогоМастера = Новый СоветДругогоМастера();
	СоветДругогоМастера.ЗначенияДеталек(Детальки);

	Возврат СоветДругогоМастера;

КонецФункции

Функция СоветДругогоМастераСОднимКоннекторомБезИмениИсточникаКакСоответствие() Экспорт

	Детальки = Новый Соответствие();

	СекцияData = Новый Соответствие();
	Детальки.Вставить("data", СекцияData);

	ИсточникиДанных = Новый Соответствие();
	СекцияData.Вставить("ИсточникиДанных", ИсточникиДанных);

	ИсточникиДанных.Вставить("ТипКоннектора", "КоннекторInMemory");

	СоветДругогоМастера = Новый СоветДругогоМастера();
	СоветДругогоМастера.ЗначенияДеталек(Детальки);

	Возврат СоветДругогоМастера;

КонецФункции

Функция СоветДругогоМастераСДвумяКоннекторамиКакМассив() Экспорт

	Детальки = Новый Соответствие();

	СекцияData = Новый Соответствие();
	Детальки.Вставить("data", СекцияData);

	ИсточникиДанных = Новый Массив();
	СекцияData.Вставить("ИсточникиДанных", ИсточникиДанных);

	ИсточникДанных = Новый Соответствие();	
	ИсточникДанных.Вставить("Имя", "Основной");
	ИсточникДанных.Вставить("ТипКоннектора", "КоннекторInMemory");
	
	ИсточникиДанных.Добавить(ИсточникДанных);

	ИсточникДанных = Новый Соответствие();
	ИсточникДанных.Вставить("Имя", "Дополнительный");
	ИсточникДанных.Вставить("ТипКоннектора", "КоннекторSQLite");
	ИсточникДанных.Вставить("СтрокаСоединения", "FullUri=file::memory:?cache=shared");
	
	ИсточникиДанных.Добавить(ИсточникДанных);
	
	СоветДругогоМастера = Новый СоветДругогоМастера();
	СоветДругогоМастера.ЗначенияДеталек(Детальки);

	Возврат СоветДругогоМастера;

КонецФункции

Функция СоветДругогоМастераСДвумяКоннекторамиИОдинБезИмениКакМассив() Экспорт

	Детальки = Новый Соответствие();

	СекцияData = Новый Соответствие();
	Детальки.Вставить("data", СекцияData);

	ИсточникиДанных = Новый Массив();
	СекцияData.Вставить("ИсточникиДанных", ИсточникиДанных);

	ИсточникДанных = Новый Соответствие();	
	ИсточникДанных.Вставить("Имя", "Основной");
	ИсточникДанных.Вставить("ТипКоннектора", "КоннекторInMemory");
	
	ИсточникиДанных.Добавить(ИсточникДанных);

	ИсточникДанных = Новый Соответствие();
	ИсточникДанных.Вставить("ТипКоннектора", "КоннекторSQLite");
	ИсточникДанных.Вставить("СтрокаСоединения", "FullUri=file::memory:?cache=shared");
	
	ИсточникиДанных.Добавить(ИсточникДанных);
	
	СоветДругогоМастера = Новый СоветДругогоМастера();
	СоветДругогоМастера.ЗначенияДеталек(Детальки);

	Возврат СоветДругогоМастера;

КонецФункции
